from dotenv import load_dotenv
# from langchain_openai import ChatOpenAI
from langchain_ollama import ChatOllama
import os
from langchain_core.prompts import PromptTemplate

load_dotenv()  # take environment variables from .env.

def main():
    information = '''
    تخرج في الكلية الحربية عام 1977، وخدم في سلاح المشاة، وعين قائدًا للمنطقة الشمالية العسكرية، وتولى منصب مدير إدارة المخابرات الحربية والاستطلاع. ثم شغل بعد ذلك منصب القائد العام للقوات المسلحة المصرية ووزير الدفاع الرابع والأربعين منذ 12 أغسطس 2012 حتى استقالته في 26 مارس 2014 للترشح للرئاسة. أدى اليمين الدستورية لولايته الرئاسية الأولى لمدة أربع سنوات أمام المحكمة الدستورية في 8 يونيو 2014، بينما أدى اليمين الدستورية لولايته الثانية أمام مجلس النواب في 2 يونيو 2018.

وُصِف السيسي من قبل مجلة فوربس بأنه «صديق للإصلاح الاقتصادي وعدو للكثير من الحريات المدنية والفكر المتطرف»، ووصف نظام حكمه بأنه سلطوي. لا يعتبر المحللون -خصوصًا في المصادر الغربية- أن مصر تحت حكم السيسي دولة ديمقراطية، مستشهدين بسجن المعارضين السياسيين، وتقليص حرية الصحافة، وعدم وجود انتخابات حرة، واتهمت منظمات حقوق الإنسان مثل هيومن رايتس ووتش قوات الأمن في عهده بانتهاكات كاستخدام التعذيب والاختفاء القسري وحبس المعارضين وأقاربهم، بينما نفى السيسي تلك الاتهامات ودعى «للتحسب من المعلومات التي تنشر بواسطة منظمات حقوقية». في الانتخابات الرئاسية عام 2018، واجه السيسي معارضة اسمية فقط بعد الاعتقال العسكري لـسامي عنان والاختفاء القسري بعد ذلك، وانسحاب أحمد شفيق بعد تهديده بتهم فساد قديمة وفقا لأحد محاميه، وانسحاب باقي المرشحين بسبب العقبات والانتهاكات المزعومة من قبل لجنة الانتخابات. بينما اعتبر السيسي أن الديمقراطية الغربية غير صالحة للشرق الأوسط سوى على المدى البعيد. بسبب الصراعات وعقبات التعليم والفقر. بدأت مصر في عهد السيسي برنامج إصلاح اقتصادي ناجح، والذي ساعد في جعل الاقتصاد المصري الأسرع نموًا في الشرق الأوسط بحلول 2019، إلا أن نسبة الفقراء استمرت في الارتفاع بسبب الإجراءات التقشفية وأزمة كورونا، وقوبل ذلك بإجراءات لتعزيز شبكات الحماية الاجتماعية. انتُقِد السيسي بسبب زيادته لدور الجيش في الاقتصاد، إلا أنه رد بأن ذلك الدور لا يتجاوز 2 بالمائة من الناتج المحلي، ونفى أن يكون على حساب القطاع الخاص. كما شهدت قدرات القوات المسلحة نموًا في عهد السيسي، وأصبحت مصر ثالث أكبر مستورد للأسلحة عالميا في الفترة 2015-19.

نشأته
ولد عبد الفتاح في 19 نوفمبر 1954 في حي الجمالية بمدينة القاهرة، لأب يدعى «سعيد حسين خليل السيسي» صاحب محل بازار، وأم تدعى «سعاد إبراهيم»، وترجع أصول عائلته إلى محافظة المنوفية.
    '''
    
    summary_template = """
    give me the {information} about the person. I want to create:
    1- short summary
    2- list of 5 key points about him"""
    
    summary_prompt_template = PromptTemplate(
        input_variables=["information"],
        template=summary_template
    )
    
    # llm = ChatOpenAI(model="gpt-5", temperature=0, openai_api_key=os.getenv("OPENAI_API_KEY"))
    llm = ChatOllama(model="gemma3:270m", temperature=0, base_url="http://localhost:11434")
    chain = summary_prompt_template | llm
    
    response = chain.invoke(input={"information": information})
    print(response.content)
    
if __name__ == "__main__":
    main()
